# 深浅拷贝

# a = [10,20, 30]
# b = a # 由于a是引用类型数据，故 为a起个别名叫b
# b[1] = 200
# print(a) # [10,200.30]

# 我们希望b独立，和a没有关联
# a = [10,20, 30]
# b = a.copy() # 将a复制一份给b, 那么b就和a没有了关系
# b[1] = 200 # b的改变不会影响到a
# print(a) # [10,20.30]


# a = [10,20]
# b = a
# c = a.copy()

# print(id(a),id(b),id(c)) # 140390167023552 140390167023552 140390168499584
# print(a == b, b == c) # True True
# print(a is b, b is c) # True False


# 浅拷贝
# a = [10,20,[30,40]]
# b = a.copy() # 浅拷贝（只赋值一层列表信息）
# b[1] = 200
# print(a) # [10,20,[30,40]]
# b[2][1] = 400
# print(a) # [10, 20, [30, 400]]


# 深度拷贝
import copy
a = [10,20,[30,40]]
b = copy.deepcopy(a) # 调用方法将a列表进行深度复制
b[1] = 200
print(a) # [10,20,[30,40]]
b[2][1] = 400
print(a) # [10,20,[30,40]]








